app/controllers/home_controller.rb

  def show
    if current_user
      @sheets = current_user.time_sheets.where('closed_at is not null').order(created_at: :desc)
      @today = current_user.time_sheets.where('created_at > ?', Time.now.beginning_of_day).where('closed_at is null').first
---
SELECT "time_sheets".* FROM "time_sheets" WHERE "time_sheets"."user_id" = ? AND (created_at > '2014-09-16 03:00:00.000000') AND (closed_at is null) ORDER BY "time_sheets"."id" ASC LIMIT 1  [["user_id", 3]]
SELECT "time_sheets".* FROM "time_sheets" WHERE "time_sheets"."user_id" = ? ORDER BY DESC  [["user_id", 3]]