app/controllers/time_sheets_controller.rb

  def close
    @time_sheet.update_attributes(closed_at: Time.now)
---
UPDATE "time_sheets" SET "closed_at" = ?, "updated_at" = ? WHERE "time_sheets"."id" = 2  [["closed_at", Tue, 16 Sep 2014 22:04:06 UTC +00:00], ["updated_at", Tue, 16 Sep 2014 22:04:06 UTC +00:00]]

  def open
    TimeSheet.create(user: current_user)
---
INSERT INTO "time_sheets" ("created_at", "updated_at", "user_id") VALUES (?, ?, ?)  [["created_at", Tue, 16 Sep 2014 22:43:59 UTC +00:00], ["updated_at", Tue, 16 Sep 2014 22:43:59 UTC +00:00], ["user_id", 3]]

    def set_time_sheet
      @time_sheet = TimeSheet.includes(:user).find(params[:id])
---
SELECT "time_sheets".* FROM "time_sheets" WHERE "time_sheets"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]